[{"content": "Anora review: This adults-only screwball comedy about a quick-witted stripper is like a 'more believable Pretty Woman'\n\nBy Nicholas Barber\n\nShare\n\nCourtesy Cannes Film Festival\n\nUS director Sean Baker's latest film exploring the world of sex work has been greeted rapturously at the Cannes Film Festival – and after great reviews for his previous work, it could be his breakout commercial hit.", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "Some writer-directors specialise in films about superheroes, others specialise in films about cowboys. Sean Baker specialises in films about people who have sex for money. They are invariably sympathetic, credible and chaotically funny slices of life, hence Tangerine (2015), The Florida Project (2017) and Red Rocket (2021) have garnered rave reviews and cult followings, even if they haven't been box-office smashes. Baker's latest film, Anora, is earthier than ever, so it might not buck that trend, but this adults-only screwball comedy is so likeable and entertaining that it might just reach a wider audience, and it might just win a prize at the Cannes Film Festival's awards ceremony today, having premiered there on Tuesday.", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "If nothing else, it should make a star of its leading lady, Mikey Madison, who appeared in Once Upon a Time In Hollywood (2019) and the rebooted Scream (2022), but is a revelatory force of nature here. She plays Ani, a twentysomething stripper from Brooklyn with a mustard-thick New Yawk accent and so much sassy charm that her quick-witted conversation is almost as attractive to her clients as her other assets. Baker being Baker, the club where she works is convincingly dingy and sleazy, and the services being offered are shown explicitly, which makes a change from the more glamorous yet prim clubs that crop up in some TV dramas. But it isn't horrifying or dangerous, which makes a change from the dives that crop up in crime thrillers. Ani and her colleagues are essentially safe and happy in their work.\n\nMore like this\n\nWill All We Imagine as Light win the Palme d'Or?\n\nThe Substance is a 'magnificently tasteless' horror comedy\n\nWhy are Cannes standing ovations so weirdly long?", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "More like this\n\nWill All We Imagine as Light win the Palme d'Or?\n\nThe Substance is a 'magnificently tasteless' horror comedy\n\nWhy are Cannes standing ovations so weirdly long?\n\nStill, that's not to say that they don't fancy making some extra money on the side. One night, Ani's boss instructs her to cosy up to a young Russian, Vanya (Mark Eidelstein), because she can speak Russian herself, and after he has had the VIP treatment, he offers to pay her to have sex with him in his house. This doesn't seem like a bad idea, as Vanya is an exuberantly friendly goofball who could be Timothée Chalamet's gawky and gangly brother. And it seems like a better idea when she catches sight of his luxury mansion.\n\nAnora fizzes with energy and laugh-out-loud moments, but it isn't recommended for anyone with high blood pressure.", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "Anora fizzes with energy and laugh-out-loud moments, but it isn't recommended for anyone with high blood pressure.\n\nIt turns out that Vanya is the son of an oligarch, and while his parents are in Russia, he is eagerly spending their cash in the US. Like a far more believable version of Richard Gere's character in Pretty Woman, he asks Ani to be his girlfriend for a week, and like a far more believable version of Julia Roberts' character, she has a blast as he hosts druggy parties, and hires a private jet to fly his buddies to Las Vegas. For a while, you could mistake Anora for a bawdy romantic comedy. The less you know about what happens next, the better, but suffice it to say that Vanya's parents send their stateside henchmen to calm the situation down, and they end up having the opposite effect.\n\nANORA\n\nDirector: Sean Baker\n\nCast: Mikey Madison, Mark Eidelstein, Yuriy Borisov\n\nRun time: 2hr 19m", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "ANORA\n\nDirector: Sean Baker\n\nCast: Mikey Madison, Mark Eidelstein, Yuriy Borisov\n\nRun time: 2hr 19m\n\nAnora fizzes with energy and laugh-out-loud moments, but it isn't recommended for anyone with high blood pressure. It builds into the kind of hectic farce in which not just one person is stressed: everyone is stressed. Baker also keeps the misadventures going for a good 20 minutes too long. Towards the end of the film's two-and-a-quarter hours, viewers may get the creeping sense that he couldn't decide how to end the story, so he kept adding scenes and hoping for the best.", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "What stops Anora becoming an upsetting ordeal is some unexpected sweetness, and the firecracker character of Ani, who is indomitably positive, fearless and aggressive throughout. It comes to something that you start to feel sorry for the three tough Russians who have the job of keeping her and Vanya apart. The film is always closely connected to reality, too, whether it's giving us an evocative, insider's tour of Coney Island, or reminding us of the insane levels of entitlement that come with being super-rich: the hard truth that gives Baker’s comedy its tinge of sadness is that some people are too privileged to believe that anyone else matters. Still, you'd have to conclude that if Vanya's family don't want anything to do with Ani, then that's their loss. Bring on the sequel.\n\n★★★★☆\n\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\n\nFacebook\n\nInstagram", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "★★★★☆\n\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\n\nFacebook\n\nInstagram\n\nCannes Film Festival\n\nFeatures\n\nFilm Reviews\n\nWatch\n\nWhat's it like to camp in Antarctica?Marc Cieslak spends a night on ice, camping under the stars.2 days ago\n\nWhy sunsets on Mars are tinted blueThe reason behind the Red Planet's nickname is also why its sunrises and sunsets look pale blue.3 days ago\n\nMolossia: A small, unrecognised 'nation' within the USWith its own currency and 'head of state', this American micronation has become an odd tourist destination.4 days ago\n\nThe celebrity dogs of CannesMessi has been a big star on the red carpet, eclipsing Meryl Streep. But who will win the Palm Dog this year?6 days ago\n\nAstronaut Peggy Whitson: How space changed my bodyPeggy Whitson has spent 675 days in space, more than any other American. Here's how it affected her body.6 days ago", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "Astronaut Peggy Whitson: How space changed my bodyPeggy Whitson has spent 675 days in space, more than any other American. Here's how it affected her body.6 days ago\n\nCan 3D printed sea walls protect marine wildlife?One team is on a mission to create 3D printed sea walls with environmental benefits.18 May 2024\n\nGhost towns: What nature does without usGhost towns are remnants of lost communities but also a testament to nature's persistence.17 May 2024\n\nSpectacular Nasa footage of solar activity behind the auroraOur star's activity is increasing and that could mean more supercharged light shows on Earth.16 May 2024\n\nAre women less likely to die in the care of female doctors?A new study says patients are less likely to die in the care of female physicians.14 May 2024\n\nAre inflatable habitats the future of life in space?As the reality of civilian space travel closes-in, engineers explore inflatable habitats.14 May 2024", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "Are inflatable habitats the future of life in space?As the reality of civilian space travel closes-in, engineers explore inflatable habitats.14 May 2024\n\nWhite gold rush: Harvesting lithium from Great Salt LakeCould the United States' largest saltwater lake hold the key to its energy future?13 May 2024\n\nA visit to one of Antarctica's stunning penguin coloniesMarc Cieslak finds out how gentoo penguins are adapting to a warming climate.11 May 2024\n\nWhy are scientists making 'moon dust'?Space agencies around the world need lunar soil.10 May 2024\n\nIn a first, orangutan seen using plant to heal injuryA wild orangutan has astonished researchers by using a medicinal plant to treat his cheek wound.9 May 2024\n\nWe're about to witness a once-in-a-lifetime star explosionAn extremely rare stellar explosion is about to happen and we will be able to witness it with the naked eye.8 May 2024", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "We're about to witness a once-in-a-lifetime star explosionAn extremely rare stellar explosion is about to happen and we will be able to witness it with the naked eye.8 May 2024\n\nCould wind power be the future of shipping?A quick look at the viable options that could make shipping more sustainable. 8 May 2024\n\nInside the growing business of pet cloningTwo decades after Dolly the sheep, cloning technology has moved on so much that you can now clone your pets.7 May 2024\n\nKing Charles: One year since the CoronationHow does King Charles III's Coronation year compare to that of his mother?7 May 2024\n\nThis is why Venus is bone dryVenus once had oceans of water but today, it's bone-dry. Now, researchers know why.6 May 2024\n\nThe rare condition that makes faces appear 'demonic'Thanks to one patient, we now have the most accurate insight into life through the eyes of people affected by it.6 May 2024\n\nMore", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "The rare condition that makes faces appear 'demonic'Thanks to one patient, we now have the most accurate insight into life through the eyes of people affected by it.6 May 2024\n\nMore\n\n1 hr agoSome Parisians save 'le pipi' to help the SeineThe plan for a swimmable Seine casts a spotlight on the people doing better things with Paris' waste, fertilising wheat for baguettes and biscuits.1 hr agoFuture\n\n21 hrs agoWhat will we eat on the Moon?The Moon may be the final frontier for mankind, but what will we eat when we get there? Pasta and protein bars made out of thin air are just the beginning.21 hrs agoTravel\n\n2 days agoFive Elvis experiences around the worldA lawsuit called Graceland’s future into question, but fans can find traces of Elvis’s life, work, and electric dancing everywhere from Tokyo to Australia and Mississippi to Denmark.2 days agoTravel", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "2 days agoThe US' 113-mile 'floating' highwayStretching 113 miles into the open ocean, this engineering marvel linked the far-flung Florida Keys to the mainland and forever changed Florida.2 days agoTravel\n\n2 days agoTom Holland's Romeo and Juliet is 'lifeless'Few theatre shows have ever generated as much hype as this new take on Shakespeare's love story featuring the Gen Z icon. Unfortunately, it's sunk by gimmicky, dour staging.2 days agoCulture", "metadata": {"source": "https://www.bbc.com/culture/article/20240524-anora-review-this-adults-only-screwball-comedy-about-a-quick-witted-stripper-is-like-a-more-believable-pretty-woman"}}, {"content": "Clive Myrie: ‘Mass shootings undermined my love for the US’\n\nEmma Saunders,\n\nCulture reporter at the Hay Festival\n\nShare\n\nGetty Images\n\nBBC news presenter Clive Myrie has said that his feelings for the US, where he reported from for many years, were affected by covering “ so many mass shootings”.\n\n“Mass shootings completely undermined my love for the place,” Myrie told an audience at the Hay Festival on Saturday.\n\nBut he added that it's \"still a place that I love on many levels\".\n\nMyrie, who also hosts Mastermind, was previously the BBC’s Washington correspondent and covered the administrations of three presidents - Bill Clinton, George Bush and Barack Obama.\n\nGetty Images\n\nHe said Mr Obama had cried in public only two or three times while in office and two of those occasions had been over the Sandy Hook massacre, when 26 people were murdered at a primary school in Connecticut in 2012.", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "Myrie added that Mr Obama had tried to “cajole Congress to bring in meaningful gun control” following the tragedy “but he wasn’t able to do it because of the power of the National Rifle Association (NRA).\"\n\n“The most powerful man on earth… cannot shift this single dial, he cannot do it,” Myrie said.\n\nHe added that he had previously thought gun culture was about the country’s history of hunting and its “wild west culture”.\n\n“But it’s not about that. It’s about being able to take on the government and the weapon to do it… and I realised that on January 6 with the insurrection.”\n\n“That is why they want their guns. It’s so terrifying. This idea about… frontier culture… it ain’t about that.”\n\nMr Obama told the BBC in 2015 that his lack of progress on getting such laws passed had been “the one area where I feel the most frustrated and stymied”.", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "Mr Obama told the BBC in 2015 that his lack of progress on getting such laws passed had been “the one area where I feel the most frustrated and stymied”.\n\nAs the political and legal wrangling over gun control continues, Democrats point out how the US is alone among industrialised nations in its high levels of gun violence.\n\nRepublicans counter that the right to possess firearms is enshrined in the US Constitution and that new gun-control legislation would be counterproductive.\n\nIn a wide-ranging discussion in front of a packed audience at Hay, Myrie also discussed racism, multiculturism, and his career in journalism, the focus of his memoir Everything is Everything.\n\nHe explained that his parents came over from Jamaica as part of the Windrush generation and settled in Bolton, where his Uncle Clive was already living.\n\nMyrie said his dad “never acclimatised” but they still “managed to make lemonades out of lemons”.", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "Myrie said his dad “never acclimatised” but they still “managed to make lemonades out of lemons”.\n\nHis father worked in a car battery factory, while his mother, a trained teacher in Jamaica, became a seamstress for Mary Quant.\n\nTheir hard work paid off and they were able to buy the house next door as well as their own.\n\n“The motherland came calling: ‘Help us rebuild (Britain post-war),’” Myrie explained.\n\n“What they got in return was a lot of racism and a lot of pain.”\n\nCalled to bar\n\nHe said his parents wanted him to follow a traditional profession and Myrie went on to study law. However, he had always harboured a desire to be a journalist after watching Whicker’s World and broadcasters like Sir Trevor McDonald and Kate Adie when he was growing up.\n\nMyrie was called to the bar but chose to join the BBC trainee scheme instead.\n\n“I was only forgiven by my parents once I started Mastermind,” he joked.", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "Myrie was called to the bar but chose to join the BBC trainee scheme instead.\n\n“I was only forgiven by my parents once I started Mastermind,” he joked.\n\nHe also said he refused to be pigeonholed by covering events like Notting Hill Carnival early on in his career.\n\nMyrie said he told his editor: “I don’t want to be seen as a black reporter, I want to be a reporter who happens to be black.”\n\nHe added that more recently, “my hand is the first to go up to cover the death of George Floyd or police brutality or Nelson Mandela’s funeral. But it’s my choice.”\n\nBooks\n\nLiterature\n\nRelated\n\nSir Lenny Henry thanks teachers who inspired him1 hr agoNewsBirmingham & Black Country\n\nWhat you need to know about Hay Festival 202420 hrs agoNewsWales\n\nJodi Picoult: ‘It’s not a badge of honour to be banned’1 day agoNewsWales\n\nMore", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "What you need to know about Hay Festival 202420 hrs agoNewsWales\n\nJodi Picoult: ‘It’s not a badge of honour to be banned’1 day agoNewsWales\n\nMore\n\n2 days agoHay Festival suspends Baillie Gifford sponsorshipMove comes after some speakers pulled out due to the company's links to Israel and fossil fuel firms.2 days agoNewsCulture\n\n2 days agoChurch and Kumar pull out of Hay book festivalCharlotte Church and Nish Kumar boycott in protest at a sponsor's links to Israel and fossil fuels.2 days agoNewsCulture\n\n15 May 2024Margin notes by poet Milton found in library bookCambridge University confirms the handwriting is that of the Paradise Lost poet, John Milton.15 May 2024NewsEngland\n\n14 May 2024Nobel Prize winning author Alice Munro dies aged 92The Canadian writer was known as the \"master of the contemporary short story\".14 May 2024NewsUS & Canada", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "14 May 2024Nobel Prize winning author Alice Munro dies aged 92The Canadian writer was known as the \"master of the contemporary short story\".14 May 2024NewsUS & Canada\n\n14 May 2024Actor playing Dylan Thomas thankful for Swift songMatthew Rhys hopes Taylor Swift namechecking Dylan Thomas will introduce him to a new generation.14 May 2024NewsWales", "metadata": {"source": "https://www.bbc.com/news/articles/ckddv99wy58o"}}, {"content": "Glue pizza and eat rocks: Google AI search errors go viral\n\nLiv McMahon,\n\nZoe Kleinman\n\nShare\n\nGetty Images\n\nGoogle's new artificial intelligence (AI) search feature is facing criticism for providing erratic, inaccurate answers.\n\nIts experimental \"AI Overviews\" tool has told some users searching for how to make cheese stick to pizza better that they could use \"non-toxic glue\".\n\nThe search engine's AI-generated responses have also said geologists recommend humans eat one rock per day.\n\nA Google spokesperson told the BBC they were \"isolated examples\".\n\nSome of the answers appeared to be based on Reddit comments or articles written by satirical site, The Onion.\n\nThey have been widely mocked on social media.\n\nBut Google insisted the feature was generally working well.\n\n\"The examples we've seen are generally very uncommon queries, and aren’t representative of most people’s experiences,\" it said in a statement.", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}, {"content": "\"The examples we've seen are generally very uncommon queries, and aren’t representative of most people’s experiences,\" it said in a statement.\n\n\"The vast majority of AI overviews provide high quality information, with links to dig deeper on the web.\"\n\nIt said it had taken action where \"policy violations\" were identified and was using them to refine its systems.\n\nIt is not the first time the company has run into problems with its AI-powered products.\n\nIn February, it was forced to pause its chatbot Gemini which was criticised for its \"woke\" responses.\n\nGemini's forerunner, Bard, also got off to a disastrous start.\n\nGoogle's new AI can find lost specs\n\nWhat is AI and how does it work?\n\nGoogle began trialling AI overviews in search results for a small number of logged-in UK users in April, but launched the feature to all US users at its annual developer showcase in mid-May.", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}, {"content": "Google began trialling AI overviews in search results for a small number of logged-in UK users in April, but launched the feature to all US users at its annual developer showcase in mid-May.\n\nIt works by using AI to provide a summary of search results, so users do not have to scroll through a long list of websites to find the information they are seeking.\n\nIt is billed as a product that  \"can take the legwork out of searching\"  though users are warned it is experimental.\n\nHowever, it is likely to be widely used - and trusted - because Google search remains the go-to search engine for many.\n\nAccording to web traffic tracker, Statcounter, Google's search engine accounts for more than 90% of the global market.\n\nIt is still fundamental to the way in which Google makes its money, and a service the firm needs to both protect and future-proof.\n\nMany industry experts agree that more focused AI-driven search is the way forward - despite the power-hungry tech's environmental price tag.", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}, {"content": "Many industry experts agree that more focused AI-driven search is the way forward - despite the power-hungry tech's environmental price tag.\n\nWhy wade through pages of search engine results and adverts to find information if a chatbot can give you a single, definitive answer?\n\nBut this only works if you can trust it.\n\nSo-called hallucinations by generative AI tools are not just a problem for Google, but as the world's largest search engine it gets more scrutiny.\n\nIn one baffling example, a reporter Googling whether they could use gasoline to cook spaghetti faster was told \"no... but you can use gasoline to make a spicy spaghetti dish\" and given a recipe.\n\nWe don’t know how many searches it got right (because they’re less funny to share on social media), but AI search clearly needs to be able to handle anything thrown at it, including the more leftfield.\n\nRival firms are facing a similar backlash over their attempts to cram more AI tools into their consumer-facing products.", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}, {"content": "Rival firms are facing a similar backlash over their attempts to cram more AI tools into their consumer-facing products.\n\nThe UK's data watchdog is looking into Microsoft after it announced a feature coming to its new range of AI-focused PCs that would take continuous screenshots of their online activity.\n\nAnd ChatGPT-maker OpenAI was called out by Hollywood actress Scarlett Johansson for using a voice likened to her own, saying she turned down its request to voice the popular chatbot.\n\nScarlett Johansson's AI row has echoes of Silicon Valley's bad old days\n\nGoogle to make Pixel phones and drones in India\n\nUK watchdog looking into Microsoft AI taking screenshots\n\nGoogle\n\nArtificial intelligence\n\nRelated\n\nGoogle to make Pixel phones and drones in India2 days agoNewsAsia\n\nGoogle using AI to create search answers in UK trial4 Apr 2024NewsTechnology\n\nGoogle looks to AI paywall option, claims report3 Apr 2024NewsBusiness\n\nMore", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}, {"content": "Google using AI to create search answers in UK trial4 Apr 2024NewsTechnology\n\nGoogle looks to AI paywall option, claims report3 Apr 2024NewsBusiness\n\nMore\n\n3 days agoScarlett Johansson's AI row has echoes of Silicon Valley's bad old daysA clash with the actor has echoes of the macho tech giants of the past, says Zoe Kleinman.3 days agoNewsBBC InDepth\n\n3 days ago'People are just not worried about being scammed'Fraudsters are increasingly using AI, but are people taking the problem seriously enough?3 days agoNewsBusiness\n\n4 days agoAirline to 'better manage' flights with AI useThe technology will help staff resolve issues for pilots and crews more quickly, easyJet says.4 days agoNewsBeds, Herts & Bucks\n\n4 days agoTynwald backs strategy to plug skills shortageThe three-year skills strategy is approved despite concerns it may be overtaken by technology.4 days agoNewsIsle of Man", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}, {"content": "4 days agoTynwald backs strategy to plug skills shortageThe three-year skills strategy is approved despite concerns it may be overtaken by technology.4 days agoNewsIsle of Man\n\n4 days agoUK watchdog looking into Microsoft AI taking screenshotsThe ICO wants to know the safeguards around Recall, which can take screengrabs of your screen every few seconds.4 days agoNews", "metadata": {"source": "https://www.bbc.com/news/articles/cd11gzejgz4o"}}]